In [1]:
from IPython.core.display import Markdown
from dotenv import load_dotenv

from common.overview import get_personal_overview

load_dotenv()

display(Markdown("# Personal Overview"))

get_personal_overview()

# Personal Overview

       day part            time   rank  score
0  2024/01    A 0 days 01:13:28  11034      0
1  2024/01    B 0 days 01:21:03  10524      0
2  2024/02    A 0 days 00:17:44   6086      0
3  2024/02    B 0 days 00:43:49   6609      0

In [2]:
from dotenv import load_dotenv
from common.overview import print_leaderboard
from IPython.core.display import Markdown

load_dotenv()

display(Markdown("# Leaderboards"))
display(Markdown("## Bol"))
print_leaderboard(257356)
display(Markdown("## Twit"))
print_leaderboard(1651008)

# Leaderboards

## Bol

                      name  local_score  stars                   progress
0          Eric Veenendaal          224      4  2200000000000000000000000
1                Marco Nel          211      4  2200000000000000000000000
2              HSteffensen          204      4  2200000000000000000000000
3            Carst Tankink          199      4  2200000000000000000000000
4            Bart Enkelaar          194      4  2200000000000000000000000
5                  EgbertW          158      3  2100000000000000000000000
6             Naval Bhagat          129      3  2100000000000000000000000
7           Jorisvanrheden          110      2  2000000000000000000000000
8               Ege Balcik          104      2  2000000000000000000000000
9             Navya Govind          102      2  2000000000000000000000000
10         Thom van de Vin          100      2  2000000000000000000000000
11           Nilson Aguiar           96      2  2000000000000000000000000
12            Dave Franken           94      2  2000000000000000000000000
13                mmeiboom           89      2  2000000000000000000000000
14       Fabrício Yamamoto           88      2  2000000000000000000000000
15  Jan-Willem Willebrands           87      2  2000000000000000000000000
16             Martijnpold           82      2  2000000000000000000000000
17            Quido Meijer           80      2  2000000000000000000000000
18                 mvanede           38      1  1000000000000000000000000

## Twit

                   name  local_score  stars                   progress
0               cyphase          208      4  2200000000000000000000000
1          Place Holder          200      4  2200000000000000000000000
2          Darren Oakey          189      4  2200000000000000000000000
3       Eric Veenendaal          188      4  2200000000000000000000000
4           Leo Laporte          187      4  2200000000000000000000000
5           -Whatever--          149      3  2100000000000000000000000
6                  ty2k          142      3  2100000000000000000000000
7   Torbjörn Pettersson           98      2  2000000000000000000000000
8         Barbara Frary           94      2  2000000000000000000000000
9            BrianSwift           88      2  2000000000000000000000000
10        Kyle Forsberg           84      2  2000000000000000000000000
11         Manny Ledoux           82      2  2000000000000000000000000
12       Markus Peltola           80      2  2000000000000000000000000
13           Simon Wall           77      2  2000000000000000000000000
14        Sarah Sorlien           77      2  2000000000000000000000000
15          John Arnold           74      2  2000000000000000000000000
16    Miquel Fire Burns           72      2  2000000000000000000000000
17    Alasdair Sinclair           70      2  2000000000000000000000000
18                ailaG           68      2  2000000000000000000000000
19          Gillian Law           66      2  2000000000000000000000000
20             Outasync           64      2  2000000000000000000000000